import 'package:flutter/material.dart';
import 'package:zaker/core/utils/app_text_style.dart';
import 'package:zaker/core/widgets/custom_container.dart';

class DoaaViewBody extends StatelessWidget {
  const DoaaViewBody({super.key});

  @override
  Widget build(BuildContext context) {
    return SingleChildScrollView(
      child: Column(
        spacing: 20,
        children: [
          CustomContainer(
            child: ExpansionTile(
              title: Text(
                'دعاء ختم القران',
                style: AppTextStyle.styleRegular18(
                  context,
                ).copyWith(color: Colors.white),
              ),
              children: [
                Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    '''
                      اللهم ارحمني بالقرآن واجعله لي إمامًا ونورًا وهدىً ورحمة، اللهم ذكرني منه ما نسيت وعلمني منه ما جهلت، وارزقني تلاوته آناء الليل وأطراف النهار، واجعله لي حجة يوم القيامة.
                      اللهم أصلح لي ديني الذي هو عصمة أمري، وأصلح لي دنياي التي فيها معاشي، وأصلح لي آخرتي التي فيها معادي، واجعل الحياة زيادة لي في كل خير، واجعل الموت راحة لي من كل شر.
                      اللهم اجعل خير عمري آخره، وخير عملي خواتمه، وخير أيامي يوم ألقاك فيه.
                      اللهم إني أسألك عيشة هنية، وميتة سوية، ومردًا غير مخزٍ ولا فاضح.
                      اللهم إني أسألك خير المسألة، وخير الدعاء، وخير النجاح، وخير العلم، وخير العمل، وخير الثواب، وخير الحياة، وخير الممات، وثبتني، وثقل موازيني، وحقق إيماني، وارفع درجاتي، وتقبل صلاتي، واغفر خطيئاتي، وأسألك العلا من الجنة.
                      اللهم إني أعوذ بك من عذاب القبر، وأعوذ بك من فتنة المسيح الدجال.
                      اللهم اجعلني في الدنيا من المقبولين، وفي الآخرة من الفائزين.
                      اللهم إني أسألك موجبات رحمتك، وعزائم مغفرتك، والسلامة من كل إثم، والغنيمة من كل بر، والفوز بالجنة، والنجاة من النار.
                      اللهم أحسن عاقبتنا في الأمور كلها، وأجرنا من خزي الدنيا وعذاب الآخرة.
                      اللهم اقسم لنا من خشيتك ما تحول به بيننا وبين معصيتك، ومن طاعتك ما تبلغنا بها جنتك، ومن اليقين ما تهون به علينا مصائب الدنيا، ومتعنا بأسماعنا، وأبصارنا، وقواتنا ما أحييتنا، واجعله الوارث منا، واجعل ثأرنا على من ظلمنا، وانصرنا على من عادانا، ولا تجعل مصيبتنا في ديننا، ولا تجعل الدنيا أكبر همنا، ولا مبلغ علمنا، ولا تسلط علينا من لا يرحمنا.
                      اللهم لا تدع لنا ذنبًا إلا غفرته، ولا همًا إلا فرجته، ولا دينًا إلا قضيته، ولا حاجة من حوائج الدنيا والآخرة هي لك رضًا إلا قضيتها يا أرحم الراحمين.
                      ربنا آتنا في الدنيا حسنة، وفي الآخرة حسنة، وقنا عذاب النار.
                      وصلى الله على نبينا محمد، وعلى آله وأصحابه الأخيار، وسلم تسليمًا كثيرًا.
                      ''',
                    style: AppTextStyle.styleRegular16(
                      context,
                    ).copyWith(color: Colors.white),
                  ),
                ),
              ],
            ),
          ),
          CustomContainer(
            child: ExpansionTile(
              title: Text(
                'دعاء الاستخاره',
                style: AppTextStyle.styleRegular18(
                  context,
                ).copyWith(color: Colors.white),
              ),
              children: [
                Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Text(
                    ' صلاة  الاستخارة  أن  يصلي  ركعتين،  ثم  يدعو  بعدها،  ويستخير  بما  ورد  عن  النبي  ﷺ  بعد  السلام  يرفع  يديه  ويسأل،  يقول:  اللهم  إني  أستخيرك  بعلمك،  وأستقدرك  بقدرتك،  وأسألك  من  فضلك  العظيم؛  فإنك  تعلم  ولا  أعلم،  وتقدر  ولا  أقدر،  وأنت  علام  الغيوب،  اللهم  إن  كنت  تعلم  أن  هذا  الأمر  ويسميه،  كأن  يتزوج  بفلانة،  سفري  إلى  البلد  الفلانية،  تجارتي  في  هذا  الشيء،  يسميه  خير  لي  في  ديني  ومعاشي  وعاقبة  أمري  فيسره  لي،  ثم  بارك  لي  فيه،  وإن  كنت  تعلم   أن  هذا  الأمر  ويسميه  باسمه  شر  لي  في  ديني  ومعاشي  وعاقبة  أمري  فاصرفه  عني،  واصرفني  عنه،  وقدر  لي  الخير  حيث  كان،  ثم  أرضني  به ',
                    style: AppTextStyle.styleRegular16(
                      context,
                    ).copyWith(color: Colors.white),
                  ),
                ),
              ],
            ),
          ),
        ],
      ),
    );
  }
}
